In [38]:
import pandas as pd
import glob
import os

In [30]:
pandas_files = [name for name in glob.glob('Sources/*')]
df_files = [os.path.basename(name) for name in glob.glob('Sources/*')]

print(pandas_files)

['Sources\\uber-raw-data-apr14.csv', 'Sources\\uber-raw-data-aug14.csv', 'Sources\\uber-raw-data-jul14.csv', 'Sources\\uber-raw-data-jun14.csv', 'Sources\\uber-raw-data-may14.csv', 'Sources\\uber-raw-data-sep14.csv']

In [42]:
def load_df():
    df_paths = [name for name in glob.glob('Sources/*')]
    lst = []
    for df in df_paths:
        data = pd.read_csv(df)
        lst.append(data)
    return pd.concat(lst)

In [43]:
df = load_df()
df.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [46]:
df_size = df.size
print(df_size)

18137308

In [45]:
df.dtypes

Date/Time     object
Lat          float64
Lon          float64
Base          object
dtype: object

In [14]:
df_apr.head(100)

             Date/Time      Lat      Lon    Base
0  2014-04-01 00:11:00  40.7690 -73.9549  B02512
1  2014-04-01 00:17:00  40.7267 -74.0345  B02512
2  2014-04-01 00:21:00  40.7316 -73.9873  B02512
3  2014-04-01 00:28:00  40.7588 -73.9776  B02512
4  2014-04-01 00:33:00  40.7594 -73.9722  B02512
..                 ...      ...      ...     ...
95 2014-04-01 06:54:00  40.7653 -73.9723  B02512
96 2014-04-01 06:56:00  40.7644 -73.9769  B02512
97 2014-04-01 06:57:00  40.7726 -73.9532  B02512
98 2014-04-01 06:59:00  40.7898 -73.9661  B02512
99 2014-04-01 07:00:00  40.7839 -73.9703  B02512

[100 rows x 4 columns]

In [8]:
df_apr['Date/Time'] = pd.to_datetime(df_apr['Date/Time'])

In [9]:
df_apr.head()

            Date/Time      Lat      Lon    Base
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512